[
  {
    "id": "3968144086",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Entry level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Information Technology"
      },
      {
        "title": "Industries",
        "value": "Software Development"
      }
    ],
    "company": "HireMeFast LLC",
    "location": "Rio Rancho, NM",
    "title": "Junior Frontend Engineer (JavaScript/HTML/CSS)",
    "link": "https://www.linkedin.com/company/hiremefast-llc-us?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "16 hours ago",
    "numberOfApplicants": "136 applicants",
    "description": "This is a remote position.\n\n DISCLAIMER:  This job posting is intended for active pooling of candidates who will become part of our talent pool. Your qualifications will be assessed against both current and future job openings. Should your application align with a role that corresponds to your skills and experience, and an opportunity arises, our recruitment team will reach out to you immediately. Please note that this does not guarantee immediate placement or contact. Additionally, we exclusively consider applications from individuals who are currently reside in the US/Canada during their application process.\n\n Salary: $62,000 - $72,000 per annum\n\n Experience Required:  Minimum 1 year of project experience\n\nRoles & Responsibilities\n\nWeb Frontend Developer, will collaborate with the team to develop and enhance the front-end of our web framework, ensuring the delivery of intuitive and visually appealing user interfaces.\n\nThey will work closely with designers, leveraging your expertise in HTML/CSS, JavaScript, React, Next.js, and UI/UX design to create clean and responsive web layouts.\n\nResponsibilities\n\nCollaborate with the project team to develop and enhance the front-end of our web framework.\n\nImplement intuitive and visually appealing user interfaces based on UI/UX designs.\n\nCreate clean and responsive web layouts using HTML/CSS.\n\nUtilize JavaScript frameworks, libraries, and best practices to enhance frontend functionality.\n\nEnsure compatibility across multiple browsers and devices.\n\nCollaborate with designers to bring their creative vision to life.\n\nFamiliarity with Git for collaborative development and version control.\n\nWork with AWS EC2 and Lambda for cloud-based development.\n\nRequirements\n\nBachelors degree in computer science, Software Engineering, or a related field (or equivalent experience).\n\n2+ years of proven experience as a Web Frontend Developer or similar role.\n\nProficiency in HTML/CSS and creating clean and responsive web layouts.\n\nStrong knowledge of JavaScript frameworks, libraries, and best practices.\n\nExperience with React and Next.js frontend frameworks.\n\nAbility to collaborate effectively with designers to implement UI/UX designs.\n\nFamiliarity with Git for collaborative development and version control.\n\nExperience working with AWS EC2, and Lambda is a plus.\n\nStrong problem-solving skills and attention to detail.\n\nExcellent communication and teamwork abilities.\n\nA passion for delivering high-quality, user-centered web experiences.\n\nExperience with Adobe Target is a nice to have."
  },
  {
    "id": "3968559834",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Entry level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Information Technology"
      },
      {
        "title": "Industries",
        "value": "Software Development"
      }
    ],
    "company": "Team Remotely Inc",
    "location": "Chicago, IL",
    "title": "Junior Web Developer",
    "link": "https://www.linkedin.com/company/team-remotely-llc?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "10 hours ago",
    "numberOfApplicants": "91 applicants",
    "description": "This is a remote position.\n\n Junior Web Developer (1 year experience, remote)\n\nBe part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.\n\n Hiring Type: Full-Time\n\n Base Salary: $65K-$75K Per Annum.\n\nDescription:\n\nYou will work closely with our senior developers to design, develop, and maintain high-quality websites and web applications. This is an excellent opportunity to gain hands-on experience in a collaborative environment and contribute to exciting projects.\n\nResponsibilities:\n\n\n* Collaborate with the development team to understand project requirements and design web solutions \n* Write clean, efficient, and well-structured code using HTML, CSS, and JavaScript \n* Assist in the development and implementation of responsive and user-friendly web interfaces \n* Integrate front-end designs with back-end functionality using appropriate technologies \n* Conduct thorough testing and debugging to ensure seamless functionality \n* Assist in website maintenance, updates, and enhancements \n* Stay up-to-date with industry trends and emerging web development technologies \n* Collaborate with cross-functional teams to deliver projects on time and within scope \n* Document technical specifications, project details, and development processes \n\n\n\nQualifications:\n\n\n* Bachelor's degree in Computer Science, Web Development, or a related field \n* Solid understanding of web development principles and best practices \n* Proficiency in HTML, CSS, and JavaScript \n* Familiarity with front-end frameworks such as Bootstrap or Foundation \n* Basic understanding of back-end development technologies (e.g., PHP, Python, or Ruby) \n* Knowledge of version control systems (e.g., Git) \n* Experience with responsive web design and mobile-first development \n* Strong problem-solving and analytical skills \n* Excellent communication and teamwork abilities \n* Self-motivated with a strong desire to learn and grow as a developer \n\n\n\nPreferred Qualifications:\n\n\n* Previous experience with web development projects (personal or professional) \n* Knowledge of JavaScript frameworks/libraries (e.g., React, Angular, or Vue.js) \n* Familiarity with content management systems (e.g., WordPress, Drupal, or Joomla) \n* Understanding of SEO principles and best practices \n* Experience with web accessibility standards and guidelines \n* Knowledge of web security best practices"
  },
  null,
  {
    "id": "3968558925",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Entry level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Information Technology"
      },
      {
        "title": "Industries",
        "value": "Software Development"
      }
    ],
    "company": "Team Remotely Inc",
    "location": "Chicago, IL",
    "title": "Junior Python Developer",
    "link": "https://www.linkedin.com/company/team-remotely-llc?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "10 hours ago",
    "numberOfApplicants": "67 applicants",
    "description": "This is a remote position.\n\n Junior Python Developer (1 year experience, remote)\n\nBe part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.\n\n Hiring Type: Full-Time\n\n Base Salary: $61K-$71K Per Annum.\n\nDescription:\n\nIn this role, you will work closely with senior developers and other cross-functional teams to develop and maintain high-quality Python applications. As a Junior Python Developer, you will have the opportunity to learn and grow your skills while contributing to exciting projects.\n\nResponsibilities:\n\n\n* Collaborate with senior developers to design and develop Python applications. \n* Write clean, efficient, and maintainable code that follows best practices. \n* Participate in code reviews and provide constructive feedback. \n* Debug and fix issues in the existing codebase. \n* Assist in testing and quality assurance processes. \n* Stay updated with the latest trends and technologies in Python development. \n\n\n\nRequirements:\n\n\n* Bachelor's degree in Computer Science, Software Engineering, or a related field. \n* Strong knowledge of Python programming language. \n* Familiarity with web frameworks such as Django or Flask. \n* Experience with version control systems, preferably Git. \n* Basic understanding of front-end technologies (HTML, CSS, JavaScript). \n* Good problem-solving and analytical skills. \n* Excellent communication and teamwork abilities. \n* Self-motivated and eager to learn. \n\n\n\nNice to have:\n\n\n* Experience with database systems such as MySQL, PostgreSQL, or MongoDB. \n* Knowledge of RESTful APIs and integration. \n* Familiarity with cloud platforms such as AWS or Azure. \n* Understanding of agile development methodologies. \n\n\n\nBenefits:\n\n\n* Flexible vacation, unlimited paid holidays, and paid sick days \n* 401(k) with up to 2% employer match \n* Health, vision, and dental insurance"
  },
  {
    "id": "3967623485",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Entry level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Engineering and Information Technology"
      },
      {
        "title": "Industries",
        "value": "Staffing and Recruiting"
      }
    ],
    "company": "Why Hiring",
    "location": "United States",
    "title": "Junior Data Scientist",
    "link": "https://www.linkedin.com/company/whyhiring?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "21 hours ago",
    "numberOfApplicants": "Over 200 applicants",
    "description": "In this role, you will play role in developing automated tools, conducting data mining, enhancing data collection procedures, and supporting various analytical and IT initiatives. Your contributions will directly support the customer's mission by creating intelligence products and automated systems that streamline processes and boost operational efficiency.\nKey Responsibilities:\n* Select and optimize features and classifiers using machine learning techniques.\n* Develop tools and systems to streamline processes and reduce manual resource hours.\n* Employ advanced methods to mine large data sets from various sources.\n* Produce intelligence products that align with USPIS strategies and missions.\n* Integrate third-party data to enhance product outcomes.\n* Automate repetitive processes and incorporate relevant data for analytical systems.\n* Process, cleanse, and verify the integrity of collected data.\n* Conduct ad-hoc analysis and present results clearly through presentations, written documents, graphs, and charts.\n* Develop and implement an automated anomaly detection system with performance tracking.\n\n\nQualifications:\n* Bachelor’s degree in Computer Science, Data Science, Statistics, or a related field (Master’s degree preferred).\n* Proven experience in developing machine learning models and automated tools.\n* Strong expertise in data mining and the use of advanced methods.\n* Experience with integrating and enhancing third-party data.\n* Proficiency in data collection, processing, and verification.\n* Ability to conduct and present ad-hoc analysis clearly and effectively.\n* Experience with anomaly detection systems and performance tracking.\n* Experience with Cloud resource hosting solutions is a plus.\n* Strong analytical, problem-solving, and communication skills."
  },
  {
    "id": "3968541939",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Mid-Senior level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Engineering and Information Technology"
      },
      {
        "title": "Industries",
        "value": "Internet Publishing"
      }
    ],
    "company": "RSA Conference",
    "location": "Boston, MA",
    "title": "Software Developer",
    "link": "https://www.linkedin.com/company/rsa-conference?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "11 hours ago",
    "numberOfApplicants": "Over 200 applicants",
    "description": "RSA Conference™ is the premier series of global events and year-round learning for the cybersecurity community. RSAC is where the security industry converges to discuss current and future concerns and have access to the experts, unbiased content and ideas that help enable individuals and companies advance their cybersecurity posture and build stronger and smarter teams. Both in-person and online, RSAC brings the cybersecurity industry together and empowers the collective “we” to stand against cyberthreats around the world. RSAC is the ultimate marketplace for the latest technologies and hands-on educational opportunities that help industry professionals discover how to make their companies more secure while showcasing the most enterprising, influential and thought-provoking thinkers and leaders in cybersecurity today.\n\nAs part of this evolution, RSAC seeks a Software Developer responsible for designing, developing, and implementing software applications based on business requirements. They contribute in a team of programmers to code services and applications that delight our customers. The Software Developer will meet our standards for maintainability by writing useful documentation, setting and enforcing coding standards, achieving optimal test coverage, automating builds and deployments, and establishing monitoring and alarms.\n\nIn this role you will:\n\n\n* Develop Software Applications Based on Business Requirements: As a skilled software developer, you will be tasked with creating robust and efficient software applications tailored to meet specific business needs. Your role involves translating intricate business requirements into functional and user-friendly software solutions. Through a deep understanding of programming languages and technologies, you craft software that aligns seamlessly with the unique demands of each project. \n* Maintain Software Applications and Implementing Enhancements: Beyond the initial development phase, you play a crucial role in the software’s lifecycle. This includes maintaining applications to ensure they function optimally, addressing any bugs or issues that may arise, and making enhancements in line with evolving project specifications. Your expertise is vital in guaranteeing the long-term effectiveness and relevance of the software. \n* Support Project Planning and Scheduling: Collaborating closely with the project manager, you assist in the development of comprehensive project plans and schedules. Your insights and technical expertise are invaluable in creating realistic timelines and resource allocations. By providing support in project planning, you contribute to the efficient execution of tasks and the successful completion of projects within established deadlines. \n* Participate in End-to-End Development Activities: Engaging in the entire software development lifecycle, you participate in diverse activities ranging from requirement analysis and design to development, rigorous testing, and eventual implementation. Your involvement ensures a holistic approach to software creation, where you meticulously analyze requirements, architect innovative solutions, rigorously test for quality assurance, and finally, implement the software, guaranteeing a seamless user experience. \n\n\n\nYour profile:\n\n\n* Bachelor’s Degree in Computer Engineering/Computer Science or Related Field \n* Excellent Communication Skills: Effective written and oral communication skills are paramount in the realm of software development. You excel in articulating complex technical concepts clearly and concisely. \n* Strong Organizational Skills: Your strong organizational skills enable you to manage multiple tasks, prioritize effectively, and meet deadlines without compromising the quality of work. \n* Strong Analytical and Problem-Solving Skills: Armed with strong analytical prowess, you excel in dissecting complex problems, identifying key issues, and formulating effective solutions. \n* Proven Experience in High-Level Programming Languages: Your proven expertise in high-level programming languages, such as Java and JavaScript, underscores your proficiency in crafting intricate and efficient code. \n* Proven Experience in Software Development Methodologies: With a wealth of experience in software development methodologies, you possess a deep understanding of structured approaches to software engineering. Whether you follow Agile, Scrum, or other methodologies, your familiarity ensures that projects progress smoothly. \n* Full-Stack Development Experience: Your track record includes successfully building complex web systems, showcasing your ability to architect sophisticated, scalable, and secure online platforms. You have experience designing maintainable APIs and are comfortable working in back end, web client, and mobile client code. \n* Experience Configuring and Managing Cloud Infrastructure: You have worked in Azure or AWS cloud infrastructure environments optimized for high availability, scalability, and security. You manage configuration as code and take advantage of automation where appropriate. \n\n\n\nBenefits\n\nRSAC believes in investing in our people. We offer:\n\n\n* Competitive salary, benefits, and perks for all full-time employees \n* Employer-subsidized medical, dental and vision insurance \n* 401K retirement employer match \n* Home office equipment stipend and monthly technology stipend \n* Thirteen paid holidays per calendar year \n* Unlimited personal time off \n* Annual employee bonus dependent upon overall company and personal performance \n* Annual company-wide offsite \n\n\n\nOur Culture\n\nWe believe that our differences make us stronger, and we are committed to fostering a culture of respect, empathy, and understanding.\n\n\n* We are a fully remote team operating across the United States, giving our employees the flexibility to work from wherever they choose. \n* Our team is passionate and results-oriented, striving to achieve excellence in everything we do. \n* We strongly believe in creating an inclusive environment that values diversity and encourages our team members to share their unique perspectives. \n* We recognize that by collaborating and working together, we can achieve our goals faster and more effectively. \n\n\n\nWhy RSAC?\n\nThe RSAC team takes great pride in helping shape the future of cybersecurity and being part of an expansive global community! We're always looking for imaginative and visionary individuals who share our passion for providing cutting-edge programs that equip cybersecurity practitioners worldwide with the intel and knowledge they need to thrive and safeguard organizations against cyberthreats.\n\nRSAC is an equal opportunity employer that is committed to inclusion and diversity. We take affirmative action to ensure all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, Veteran status, or other legally protected characteristics.\n\nOur Values\n\n\n* Adaptability: In our ever-changing world, we innovate through determination, creativity and resourcefulness. \n* Community: We bring people together and build trust by embracing the unique thoughts and perspectives of others with kindness and respect. \n* Excellence: Because we are where the world talks security, we have the highest expectations of ourselves and our partners. \n\n\n\nPowered by JazzHR\n\nUbhmT7733e"
  },
  {
    "id": "3968542846",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Mid-Senior level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Engineering and Information Technology"
      },
      {
        "title": "Industries",
        "value": "Internet Publishing"
      }
    ],
    "company": "RSA Conference",
    "location": "Boston, MA",
    "title": "Software Developer",
    "link": "https://www.linkedin.com/company/rsa-conference?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "11 hours ago",
    "numberOfApplicants": "Over 200 applicants",
    "description": "RSA Conference™ is the premier series of global events and year-round learning for the cybersecurity community. RSAC is where the security industry converges to discuss current and future concerns and have access to the experts, unbiased content and ideas that help enable individuals and companies advance their cybersecurity posture and build stronger and smarter teams. Both in-person and online, RSAC brings the cybersecurity industry together and empowers the collective “we” to stand against cyberthreats around the world. RSAC is the ultimate marketplace for the latest technologies and hands-on educational opportunities that help industry professionals discover how to make their companies more secure while showcasing the most enterprising, influential and thought-provoking thinkers and leaders in cybersecurity today.\n\nAs part of this evolution, RSAC seeks a Software Developer responsible for designing, developing, and implementing software applications based on business requirements. They contribute in a team of programmers to code services and applications that delight our customers. The Software Developer will meet our standards for maintainability by writing useful documentation, setting and enforcing coding standards, achieving optimal test coverage, automating builds and deployments, and establishing monitoring and alarms.\n\nIn this role you will:\n\n\n* Develop Software Applications Based on Business Requirements: As a skilled software developer, you will be tasked with creating robust and efficient software applications tailored to meet specific business needs. Your role involves translating intricate business requirements into functional and user-friendly software solutions. Through a deep understanding of programming languages and technologies, you craft software that aligns seamlessly with the unique demands of each project. \n* Maintain Software Applications and Implementing Enhancements: Beyond the initial development phase, you play a crucial role in the software’s lifecycle. This includes maintaining applications to ensure they function optimally, addressing any bugs or issues that may arise, and making enhancements in line with evolving project specifications. Your expertise is vital in guaranteeing the long-term effectiveness and relevance of the software. \n* Support Project Planning and Scheduling: Collaborating closely with the project manager, you assist in the development of comprehensive project plans and schedules. Your insights and technical expertise are invaluable in creating realistic timelines and resource allocations. By providing support in project planning, you contribute to the efficient execution of tasks and the successful completion of projects within established deadlines. \n* Participate in End-to-End Development Activities: Engaging in the entire software development lifecycle, you participate in diverse activities ranging from requirement analysis and design to development, rigorous testing, and eventual implementation. Your involvement ensures a holistic approach to software creation, where you meticulously analyze requirements, architect innovative solutions, rigorously test for quality assurance, and finally, implement the software, guaranteeing a seamless user experience. \n\n\n\nYour profile:\n\n\n* Bachelor’s Degree in Computer Engineering/Computer Science or Related Field \n* Excellent Communication Skills: Effective written and oral communication skills are paramount in the realm of software development. You excel in articulating complex technical concepts clearly and concisely. \n* Strong Organizational Skills: Your strong organizational skills enable you to manage multiple tasks, prioritize effectively, and meet deadlines without compromising the quality of work. \n* Strong Analytical and Problem-Solving Skills: Armed with strong analytical prowess, you excel in dissecting complex problems, identifying key issues, and formulating effective solutions. \n* Proven Experience in High-Level Programming Languages: Your proven expertise in high-level programming languages, such as Java and JavaScript, underscores your proficiency in crafting intricate and efficient code. \n* Proven Experience in Software Development Methodologies: With a wealth of experience in software development methodologies, you possess a deep understanding of structured approaches to software engineering. Whether you follow Agile, Scrum, or other methodologies, your familiarity ensures that projects progress smoothly. \n* Full-Stack Development Experience: Your track record includes successfully building complex web systems, showcasing your ability to architect sophisticated, scalable, and secure online platforms. You have experience designing maintainable APIs and are comfortable working in back end, web client, and mobile client code. \n* Experience Configuring and Managing Cloud Infrastructure: You have worked in Azure or AWS cloud infrastructure environments optimized for high availability, scalability, and security. You manage configuration as code and take advantage of automation where appropriate. \n\n\n\nBenefits\n\nRSAC believes in investing in our people. We offer:\n\n\n* Competitive salary, benefits, and perks for all full-time employees \n* Employer-subsidized medical, dental and vision insurance \n* 401K retirement employer match \n* Home office equipment stipend and monthly technology stipend \n* Thirteen paid holidays per calendar year \n* Unlimited personal time off \n* Annual employee bonus dependent upon overall company and personal performance \n* Annual company-wide offsite \n\n\n\nOur Culture\n\nWe believe that our differences make us stronger, and we are committed to fostering a culture of respect, empathy, and understanding.\n\n\n* We are a fully remote team operating across the United States, giving our employees the flexibility to work from wherever they choose. \n* Our team is passionate and results-oriented, striving to achieve excellence in everything we do. \n* We strongly believe in creating an inclusive environment that values diversity and encourages our team members to share their unique perspectives. \n* We recognize that by collaborating and working together, we can achieve our goals faster and more effectively. \n\n\n\nWhy RSAC?\n\nThe RSAC team takes great pride in helping shape the future of cybersecurity and being part of an expansive global community! We're always looking for imaginative and visionary individuals who share our passion for providing cutting-edge programs that equip cybersecurity practitioners worldwide with the intel and knowledge they need to thrive and safeguard organizations against cyberthreats.\n\nOur Values\n\n\n* Adaptability: In our ever-changing world, we innovate through determination, creativity and resourcefulness. \n* Community: We bring people together and build trust by embracing the unique thoughts and perspectives of others with kindness and respect. \n* Excellence: Because we are where the world talks security, we have the highest expectations of ourselves and our partners. \n\n\n\nPowered by JazzHR\n\nox8sHko8ay"
  },
  {
    "id": "3968551032",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Entry level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Information Technology"
      },
      {
        "title": "Industries",
        "value": "IT Services and IT Consulting"
      }
    ],
    "company": "SynergisticIT",
    "location": "Norfolk, VA",
    "title": "Entry/Junior Data Analyst - Remote",
    "link": "https://www.linkedin.com/company/synergisticit?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "11 hours ago",
    "numberOfApplicants": "44 applicants",
    "description": "Since 2010 Synergisticit has helped Jobseekers get employed in the tech Job market by providing candidates the requisite skills, experience and technical competence to outperform at interviews and at clients. Here at SynergisticIT We just don't focus on getting you a tech Job we make careers.\n\nIn this Job market also, our candidates are able to achieve multiple job offers and $100k + salaries.\n\nplease check the below links to see success outcomes, salaries of our candidates .\n\nWe regularly interact with the Top Tech companies to give our candidates a competitive advantage-Please visit the below videos exhibiting at Oracle Cloud world /Oracle Java one (Las vegas) -2023/2022 and at Gartner Data Analytics Summit (Florida)-2023\n\nAll Positions are open for all visas and US citizens\n\nWe at Synergisticit understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped 1000's of candidates get jobs at technology clients like apple, google, Paypal, western union, Client, visa, walmart labs etc to name a few.\n\nCurrently, We are looking for entry-level software programmers, Java Full stack developers, Python/Java developers, Data analysts/ Data Scientists, Machine Learning engineers for full time positions with clients.\n\nWho Should Apply Recent Computer science/Engineering /Mathematics/Statistics or Science Graduates or People looking to switch careers or who have had gaps in employment and looking to make their careers in the Tech Industry.\n\nWe assist in filing for STEM extension and also for H1b and Green card filing to Candidates\n\nWe want Data Science/Machine learning/Data Analyst and Java Full stack candidates\n\nFor data Science/Machine learning Positions\n\nRequired Skills\n\nBachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT\n\nProject work on the technologies needed\n\nHighly motivated, self-learner, and technically inquisitive\n\nExperience in programming language Java and understanding of the software development life cycle\n\nKnowledge of Statistics, Gen AI, LLM, Python, Computer Vision, data visualization tools\n\nExcellent written and verbal communication skills\n\nPreferred skills: NLP, Text mining, Tableau, PowerBI, Databricks, Tensorflow\n\nREQUIRED SKILLS For Java /Full Stack/Software Positions\n\nBachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT\n\nHighly motivated, self-learner, and technically inquisitive\n\nExperience in programming language Java and understanding of the software development life cycle\n\nProject work on the skills\n\nKnowledge of Core Java , javascript , C++ or software programming\n\nSpring boot, Microservices, Docker, Jenkins, Github, Kubernates and REST API's experience\n\nExcellent written and verbal communication skills\n\nIf you get emails from our Job Placement team and are not interested please email them or ask them to take you off their distribution list and make you unavailable as they share the same database with the client servicing team who only connect with candidates who are matching client requirements.\n\nNo phone calls please. Shortlisted candidates would be reached out. No third party or agency candidates or c2c candidates"
  },
  {
    "id": "3968552737",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Entry level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Engineering and Information Technology"
      },
      {
        "title": "Industries",
        "value": "Software Development"
      }
    ],
    "company": "Roulettech Inc.",
    "location": "Pittsburgh, PA",
    "title": "Junior Software Engineer",
    "link": "https://www.linkedin.com/company/roulettech-inc?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "10 hours ago",
    "numberOfApplicants": "Over 200 applicants",
    "description": "Company DescriptionRoulettech, Inc. is a technology company dedicated to producing high-demand and high-quality products. Our flagship product, Kangacook, is a recipe-sharing platform that focuses on bridging the gap between traditional culinary heritage and modern digital needs. Kangacook provides a space for users in North America (the United States and Canada) to share, discover, and recreate authentic Asian recipes using ingredients available at local grocery stores. The platform aims to increase convenience, reduce time spent searching for recipes, and promote cultural culinary exploration.\nKangacook: https://kangacook.com\nRole DescriptionThis is a full-time remote role for a Junior Software Engineer. As a Junior Software Engineer, you will be responsible for various day-to-day tasks related to software development, including back-end web development and programming. You will work closely with the development team to design, implement, and maintain software solutions for Kangacook. This role requires strong problem-solving skills and the ability to work independently and collaboratively in a remote setting.\nQualifications\n* Computer Science and Software Development skills\n* Experience in Full Stack Web Development (React, Django)\n* Experience in AWS services\n* Programming and Object-Oriented Programming (OOP) skills\n* Strong problem-solving and analytical thinking abilities\n* Excellent written and verbal communication skills\n* Ability to work independently and remotely\n* Experience with agile development methodologies is a plus\n* Bachelor's degree in Computer Science or related field"
  },
  {
    "id": "3968560763",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Entry level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Information Technology"
      },
      {
        "title": "Industries",
        "value": "Software Development"
      }
    ],
    "company": "Team Remotely Inc",
    "location": "Chicago, IL",
    "title": "Junior PHP Developer",
    "link": "https://www.linkedin.com/company/team-remotely-llc?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "10 hours ago",
    "numberOfApplicants": "36 applicants",
    "description": "This is a remote position.\n\nJunior PHP Developer (1 year experience, remote)\n\nBe part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.\n\nHiring Type: Full-Time\n\nBase Salary: $57K-$67K Per Annum.\n\nDescription:\n\nYou will collaborate with senior developers to write clean, efficient, and well-documented code using PHP and related technologies. This is an excellent opportunity to gain hands-on experience and enhance your skills in PHP development within a supportive and collaborative environment.\n\nResponsibilities:\n\n\n* Collaborate with the development team to understand project requirements and objectives \n* Assist in the design and development of web applications using PHP and related technologies \n* Write clean, efficient, and maintainable code following best practices \n* Implement and integrate APIs and web services for seamless communication with external systems \n* Conduct testing and debugging to ensure the functionality and reliability of applications \n* Optimize application performance and scalability through code optimization and database query tuning \n* Collaborate with designers to ensure a visually appealing and user-friendly interface \n* Stay up-to-date with the latest PHP development trends and technologies \n* Participate in code reviews and provide constructive feedback to improve code quality \n* Document technical specifications and project details \n\n\n\nQualifications:\n\n\n* Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent work experience) \n* Solid understanding of PHP development principles and best practices \n* Proficiency in PHP programming language \n* Familiarity with web development frameworks like Laravel, Symfony, or CodeIgniter \n* Experience with front-end development languages such as HTML, CSS, and JavaScript \n* Knowledge of database systems and experience with SQL \n* Understanding of version control systems (e.g., Git) \n* Strong problem-solving and analytical skills \n* Excellent communication and collaboration abilities \n* Ability to work independently and within a team \n* Eagerness to learn and adapt to new technologies \n\n\n\nPreferred Qualifications:\n\n\n* Experience with PHP-based CMS platforms (e.g., WordPress, Drupal) \n* Familiarity with front-end frameworks/libraries like React, Angular, or Vue.js \n* Knowledge of NoSQL databases \n* Exposure to Agile development methodologies \n* Basic understanding of software testing principles and methodologies"
  },
  {
    "id": "3967660153",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Mid-Senior level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Engineering and Information Technology"
      },
      {
        "title": "Industries",
        "value": "Staffing and Recruiting"
      }
    ],
    "company": "Carter Maddox",
    "location": "United States",
    "title": "Frontend Developer",
    "link": "https://uk.linkedin.com/company/carter-maddox-associates-ltd?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "17 hours ago",
    "numberOfApplicants": "Over 200 applicants",
    "description": "Carter Maddox, the leading talent and growth partner for the Renewable Energy industry, are currently searching for a Frontend Developer for a rapidly growing technology companies in Renewables.\nThe Role:\n* Development of cutting-edge software products using modern technology and cloud services for the renewable industry.\n* Focused on inputs/requirements for the product regarding the US customers and doing this in close relationship with the R&D product team.\n* New additions to the product based on customer promises or demands.\n* Fixes, or improvements in product, both front end and/or backend.\n* Integrations to industrial real-time protocols/equipment’s/systems used in\n* renewables.\n* Work in agile teams.\n* Developing and designing horizontal scalable solutions and architecture.\n* Testing and documentation.\n\n\nThe Skills:\n* Master's or bachelor’s degree in computer science with some years of experience from software development.\n* Strong English language skills.\n* Personal skills:\n* You are a team player with ability to cooperate and communicate effectively with clients and colleagues\n* You are trustworthy, responsible, and dedicated to your work.\n* Soft skills like flexibility, openness, and ability to adapt to an agile environment are\n* also appreciated skills.\n\n\nTech Skills\n* We are looking for a senior developer with skills in one or several of these technologies:\n* Vue.JS\n* C#\n* MS SQL Server, NoSQL, Redis and/or others,\n* JavaScript / TypeScript\n* Candidates with experience in Java, C or C++ will also be considered\n\n\nIf you feel you are a good fit, please apply below!"
  },
  {
    "id": "3968143132",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Entry level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Information Technology"
      },
      {
        "title": "Industries",
        "value": "Software Development"
      }
    ],
    "company": "Team Remotely Inc",
    "location": "Bridgeport, CT",
    "title": "Quality Assurance Tester",
    "link": "https://www.linkedin.com/company/team-remotely-llc?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "16 hours ago",
    "numberOfApplicants": "70 applicants",
    "description": "This is a remote position.\n\nQuality Assurance Tester (1 year experience, remote)\n\nBe part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.\n\n Hiring Type: Full-Time\n\n Base Salary: $56K-$66K Per Annum.\n\nOverview:\n\nYou will be responsible for ensuring the product is in pristine condition, creating test cases, ensuring the requirements are fully implemented, proposing improvement points, and analyzing whether the features and the products can solve the user’s needs.\n\nRequirements:\n\n\n* Good problem-solving skills. \n* Loves to play and find loopholes in a game/app. \n* Strong knowledge of software QA methodologies, tools, and processes. \n* Proven ability to employ analytical thinking to solve problems and generate solutions. \n* Ability to troubleshoot and think out of the box. \n* Proven ability to collaborate in a multicultural team. \n* Ability to remain focused in a team-oriented environment. \n* Ability and willingness to keep learning. \n* Ability to use software tools such as Gitlab, Word Processor, Spreadsheet, and Web Browser. \n* Knowledge of modern education systems and development fields is desirable. \n* Good verbal and written communication skills (Required language: English) \n\n\n\nEducational Background:\n\n\n* Has a Bachelor’s degree in engineering, computer science, computer engineering, or a similar major. \n* Experience writing clear, concise, and comprehensive test strategies, plans, and cases. \n* Understand the difference between white-box, grey-box, and black-box testing. \n* Proven work experience in software quality assurance. \n* Proven work experience in the game industry. \n* Experience with automated testing tools. \n* Understanding of basic user experience design patterns – such as button placement, screen space use, hot zones, critical paths, and color pallet. \n* Experience writing automated UI testing scenarios using Selenium or equivalent frameworks. \n\n\n\nTasks:\n\n\n* Writing test plans and creating test cases for the products. \n* Collaborate with other QA Testers and developers to develop strategies and an effective test plan. \n* Run test cases and analyze the results. \n* Report bugs and errors to the development team in detail. \n* Propose improvement points that will ease the user experience. \n* Help solve problems faced by users and propose ideas to bypass errors. \n* Work with cross-division teams to ensure quality throughout the software development cycle. \n* Develop and apply testing processes for new and existing products to meet users’ needs. \n\n\n\nBenefits\n\n\n* Working remotely with an international team \n* Healthcare \n* Internet package incentive"
  },
  {
    "id": "3965457062",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Entry level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Information Technology"
      },
      {
        "title": "Industries",
        "value": "Human Resources Services"
      }
    ],
    "company": "Get It Recruit - Information Technology",
    "location": "Pompano Beach, FL",
    "title": "Data Analyst - Remote | WFH",
    "link": "https://www.linkedin.com/company/get-it-recruit-information-technology?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "13 hours ago",
    "numberOfApplicants": "41 applicants",
    "description": "We're seeking a talented Data Analyst to join our growing team! In this hybrid role, you'll collaborate across departments to collect,\n\nanalyze, and interpret data, empowering strategic decision-making throughout the organization.\n\nWhat You'll Do\n\nPartner with various teams to gather data from diverse sources, ensuring its accuracy and quality.\n\nCraft clear and informative dashboards and reports to track key product metrics.\n\nDevelop repeatable, scalable data views to empower teams with self-service analytics.\n\nWeave data from different sources into compelling narratives that drive informed choices.\n\nLeverage statistical analysis and data visualization techniques to uncover trends, patterns, and valuable insights.\n\nBuild and maintain data models, databases, and reporting systems that support data-driven decisions.\n\nDesign charts, graphs, and visualizations that effectively communicate complex information.\n\nUtilize predictive analytics to anticipate future trends and opportunities.\n\nClean, transform, and prepare data for analysis, safeguarding its integrity.\n\nIntegrate data from multiple sources and troubleshoot data-related challenges.\n\nImplement and uphold data governance practices to ensure data accuracy, security, and compliance.\n\nPartner with department heads and leadership to provide data-driven insights and recommendations.\n\nWhat We're Looking For\n\nBachelor's degree in Statistics, Mathematics, Computer Science, or a related field (Master's degree a plus).\n\nProven experience as a Data Analyst or similar role.\n\nExperience with financial planning and analytics is a plus.\n\nProficiency in data analysis and visualization tools (e.g., Excel, Tableau, Power BI).\n\nStrong understanding of data management and database systems (SQL, NoSQL).\n\nFamiliarity with statistical analysis and predictive modeling is a plus.\n\nExcellent problem-solving and analytical skills.\n\nImpeccable attention to detail and a commitment to data accuracy.\n\nEffective communication and presentation skills.\n\nAbility to thrive in a collaborative environment and translate complex findings for non-technical audiences.\n\nThe Perks\n\nCompetitive salary range: $85,000 - $100,000 annually.\n\nHybrid work model: 3 days in office, 2 days remote (following probation).\n\nOpportunity to make a real impact on a growing company!\n\nReady to join a team that values data-driven decision making? We look forward to hearing from you!\n\nEmployment Type: Full-Time"
  },
  {
    "id": "3968560767",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Entry level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Information Technology"
      },
      {
        "title": "Industries",
        "value": "Software Development"
      }
    ],
    "company": "Team Remotely Inc",
    "location": "New York, NY",
    "title": "Junior Python Django Developer",
    "link": "https://www.linkedin.com/company/team-remotely-llc?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "10 hours ago",
    "numberOfApplicants": "Be among the first 25 applicants",
    "description": "This is a remote position.\n\n Junior Python Django Developer (1 year experience, remote)\n\nBe part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.\n\n Hiring Type: Full-Time\n\n Base Salary: $59K-$69K Per Annum.\n\nAbout The Job\n\nAs a Python Django Developer, you will be responsible for developing and maintaining our SaaS product, utilizing Django, Django Rest Framework (DRF), Celery, and MySQL. Your role will involve creating efficient and scalable RESTful services, ensuring high-quality code, and collaborating with cross-functional teams to deliver a superior user experience.\n\nResponsibilities :\n\n\n* Develop and maintain our SaaS product using Python and Django. \n* Utilize Celery for task scheduling and distributed message passing. \n* Write clean, maintainable, and efficient code, adhering to best practices and coding standards. \n* Optimize application performance, scalability, and reliability. \n* Troubleshoot and debug issues, identifying and implementing solutions. \n* Collaborate with other team members on code reviews and continuous improvement. \n* Stay updated with industry trends and advancements in Django, Python, and related technologies. \n\n\n\nQualifications :\n\n\n* Bachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent experience). \n* Proven experience as a Python Django Developer, preferably working on SaaS products. \n* Strong proficiency in Python and Django framework. \n* Familiarity with Celery for task scheduling and distributed systems. \n* Proficiency in MySQL or other relational databases. \n* Solid understanding of software development principles and best practices. \n* Strong problem-solving skills and ability to troubleshoot and debug complex issues. \n* Excellent communication and teamwork skills. \n* Self-motivated and able to work independently, as well as in a team environment. \n* Strong attention to detail and commitment to delivering high-quality work."
  },
  {
    "id": "3965804316",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Not Applicable"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Engineering and Information Technology"
      },
      {
        "title": "Industries",
        "value": "Software Development"
      }
    ],
    "company": "Microsoft",
    "location": "Redmond, WA",
    "title": "Software Engineer",
    "link": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "Just now",
    "numberOfApplicants": "Be among the first 25 applicants",
    "description": "Microsoft’s Cloud Operations and Innovation (CO+I) team builds and operates Microsoft datacenters, which in turn power Microsoft’s cloud business. We anticipate and provide capacity for continuous scale. The CO+I Engineering team (CO+IE) delivers services, applications, and automation supporting datacenter planning, construction, and operation. We own a large portfolio of services, including workflows that enable predicable, lowest cost datacenter construction, telemetry systems that drive high availability and optimized energy usage, and task and performance management applications that help our operation run as efficiently as possible. CO+I Engineering is a competitive advantage for Microsoft, and an important pillar in its cloud success.\n\nWe are looking for a passionate, innovative, high energy individual contributor Software Engineer who can deal with ambiguity and challenge the status-quo to deliver automation capabilities that power the long-range execution planning efforts, drive workflow improvements and build solutions to assist in the delivery of large scale data centers through efficient management of cost and schedule.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nIn alignment with our Microsoft values, we are committed to cultivating an inclusive work environment for all employees to positively impact our culture every day.\n\nResponsibilities\n\nWe are looking for a passionate, innovative, high energy individual contributor who can deal with ambiguity and challenge the status-quo to deliver automation capabilities that power the long-range execution planning efforts, drive workflow improvements and build solutions to assist in the delivery of large scale data centers through efficient management of cost and schedule. You will:\n\n\n* Work with appropriate stakeholders to determine user requirements for a feature.\n* Support identification of dependencies, and the development of design documents for a product feature with oversight.\n* With guidance, learn to create and implement code for a product, service, or feature reusing code as applicable.\n* Assist and learn about breaking down work items into tasks and provides estimation.\n* Act as a Designated Responsible Individual (DRI) in monitoring system/product feature/service for degradation, downtime, or interruptions for simple problems, and recommend actions to restore system/product/service by following the playbook.\n* Review current developments and proactively seeks new knowledge that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale.\n\n\n\nOther\n\n\n* Embody our Culture  & Values\n\n\n\nQualifications\n\nRequired/Minimum Qualifications:\n\n\n* Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n* OR equivalent experience.\n\n\n\nOther Requirements\n\n\n* Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to, the following specialized security screenings: Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\n\n\nPreferred/Additional Qualifications\n\n\n* Bachelor's Degree in Computer Science OR related technical field AND 1+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python \n* OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience.\n\n\n\nSoftware Engineering IC2 - The typical base pay range for this role across the U.S. is USD $81,900 - $160,200 per year. There is a different range applicable to specific work locations, within the San Francisco Bay area and New York City metropolitan area, and the base pay range for this role in those locations is USD $105,600 - $174,600 per year.\n\nCertain roles may be eligible for benefits and other compensation. Find additional benefits and pay information here: https://careers.microsoft.com/us/en/us-corporate-pay.\n\nMicrosoft will accept applications for the role until July 10, 2024.\n\n#COICareers\n\n#COIEngCareers\n\n#COIE_DPXEcareers\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations."
  },
  null,
  null,
  {
    "id": "3968560758",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Entry level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Information Technology"
      },
      {
        "title": "Industries",
        "value": "Software Development"
      }
    ],
    "company": "Team Remotely Inc",
    "location": "New York, NY",
    "title": "Junior Node.JS Developer",
    "link": "https://www.linkedin.com/company/team-remotely-llc?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "10 hours ago",
    "numberOfApplicants": "Be among the first 25 applicants",
    "description": "This is a remote position.\n\nJunior Node.JS Developer (1 year experience, remote)\n\nBe part of our future! This job posting builds our talent pool for potential future openings. We'll compare your skills and experience against both current and future needs. If there's a match, we'll contact you directly. No guarantee of immediate placement, and we only consider applications from US/Canada residents during the application process.\n\nHiring Type: Full-Time\n\nBase Salary: $65K-$75K Per Annum.\n\nDescription:\n\nIn this role, you will work closely with experienced developers and contribute to the design, development, and maintenance of robust and scalable applications using Node.js. This is an excellent opportunity for someone looking to kick-start their career in web development.\n\nResponsibilities:\n\n\n* Collaborate with the development team to gather project requirements and specifications. \n* Assist in the design, development, and maintenance of server-side applications using Node.js. \n* Learn to develop and consume RESTful APIs, integrating with third-party services. \n* Write clean and efficient code following best practices and coding standards. \n* Participate in unit testing and debugging to ensure code quality and reliability. \n* Collaborate with front-end developers to integrate server-side logic with client-side components. \n* Contribute to code reviews and actively participate in knowledge sharing. \n* Stay updated with emerging technologies and industry trends to enhance your skills and knowledge. \n* Seek guidance and support from senior team members to resolve technical issues. \n\n\n\nQualifications\n\n\n* Bachelor's degree in Computer Science, Software Engineering, or a related field. \n* Basic understanding of JavaScript and web technologies. \n* Familiarity with Node.js and its ecosystem. \n* Understanding of asynchronous programming and event-driven architecture. \n* Knowledge of databases and SQL. \n* Strong problem-solving and analytical skills. \n* Excellent communication and collaboration abilities. \n* Eagerness to learn and a passion for web development. \n* Ability to work both independently and in a team-oriented, collaborative environment. \n\n\n\nBenefits:\n\n\n* Competitive salary based on skills, qualifications, and experience. \n* Comprehensive health, dental, and vision insurance plans. \n* Paid time off and holidays. \n* Flexible work schedule and remote work options. \n* Mentorship and guidance from experienced developers. \n* Learning and growth opportunities to enhance your skills and knowledge in web development. \n* Access to resources and training programs to stay updated with emerging technologies and industry trends."
  },
  {
    "id": "3908984017",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Mid-Senior level"
      },
      {
        "title": "Employment type",
        "value": "Full-time"
      },
      {
        "title": "Job function",
        "value": "Engineering and Information Technology"
      },
      {
        "title": "Industries",
        "value": "Internet Publishing"
      }
    ],
    "company": "U.S. News & World Report",
    "location": "United States",
    "title": "AI Software Developer",
    "link": "https://www.linkedin.com/company/us-news-and-world-report?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "18 hours ago",
    "numberOfApplicants": "Over 200 applicants",
    "description": "U.S. News & World Report is a multifaceted digital media company dedicated to helping citizens, consumers, business leaders and policy officials make important decisions in their lives. We publish independent reporting, rankings, data journalism and advice that has earned the trust of our readers and users for nearly 90 years. Our platforms on usnews.com include Education, Health, Money, Travel, Cars, News and 360 Reviews.\n\nWe reach more than 40 million people monthly during moments when they are most in need of expert advice and motivated to act on that advice directly on our platforms. Our signature franchises include our “Best” series of consumer guides on colleges, graduate schools, hospitals, diets, cars, financial services and more. These guides provide an easy-to-digest list for consumers to better understand and compare when making their decisions. We continue to publish annual guides of the authoritative Best Colleges and Best Hospitals rankings on our website and in print. And our U.S. News Live flagship conferences highlight important national conversations including Healthcare of Tomorrow and Healthiest Communities.\n\nWe believe in having a broad range of talent and backgrounds at U.S. News. We strive to maintain a welcoming workplace where everyone is given an opportunity to succeed and contribute to their fullest. Learn more about our Diversity, Equity and Inclusion initiative.\n\nYour role in helping us shape the future:\n\nWe are seeking a talented and passionate AI Software Developer to join our team and drive the development of the next generation of AI-powered applications. In this role, you will be responsible for the entire lifecycle of AI software development, from designing and building algorithms to testing and deploying them in production.\n\nAre you up to the challenge?\n\n\n* Integrate AI models into existing or new software systems \n* Develop and maintain clean, efficient, and well-documented code \n* Implement scalable and efficient AI-enhanced solutions that can handle large volumes of data. \n* Test and debug AI-augmented software to ensure accuracy and reliability \n* Stay up-to-date on the latest advancements in AI research and development \n* Collaborate with Product managers, designers, and other software developers \n\n\n\n\nYou should definitely have:\n\n\n* Bachelor's or Master's degree in Computer Science, Engineering, or related field.\n\n\n\n* Proven experience in developing AI-powered applications and solutions. \n* Strong proficiency in programming languages such as Python, Java, or C++. \n* Hands-on experience with popular AI application frameworks such as LangChain and LlamaIndex, and libraries such as TensorFlow, PyTorch etc. \n* Experience with data preprocessing, feature engineering, AI safety, and LLM model evaluation. \n* Excellent problem-solving skills and ability to think creatively. \n* Strong communication and teamwork abilities. \n* Experience with cloud platforms (e.g., AWS, Azure, Google Cloud) and containerization technologies (e.g., Docker, Kubernetes) is a plus. \n\n\n\n\nWhat it’s like to work with us:\n\nTalent is our best asset!\n\n\n* We invest in people with passion and potential who understand U.S. News’ dedication to our consumers. \n* Entrepreneurial, mission-driven culture with core values of quality and integrity \n* Focus on fostering personal and professional growth \n* Competitive benefits including paid vacation time, medical, tuition reimbursement, and training \n* Collaborative Work Environment : Fun, diverse, inclusive and ambitious co-workers. \n\n\n\n\nOther Job Info:\n\n\n* These statements are intended to describe the general nature and level of work being performed by employees assigned to this job. This is not intended to be an exhaustive list of all responsibilities, duties, and skills required of employees assigned to this job. \n* U.S. News & World Report strongly encourages all employees to be fully vaccinated (including boosters)."
  },
  {
    "id": "3967674910",
    "criteria": [
      {
        "title": "Seniority level",
        "value": "Entry level"
      },
      {
        "title": "Employment type",
        "value": "Contract"
      },
      {
        "title": "Job function",
        "value": "Business Development and Sales"
      },
      {
        "title": "Industries",
        "value": "IT Services and IT Consulting"
      }
    ],
    "company": "QuantumBricks",
    "location": "United States",
    "title": "ETL Developer",
    "link": "https://www.linkedin.com/company/quantumbricks-inc?trk=public_jobs_topcard-org-name",
    "postedTimeAgo": "14 hours ago",
    "numberOfApplicants": "Over 200 applicants",
    "description": "Qualifications\n\n\n* A Bachelor's Degree in Computer Science, Information Systems, or a related field\n* 7+ years of experience in ETL development, preferably in the financial services industry\n* API integration using Python\n* Proficiency with ETL tools such as Airflow, Informatica, SSIS, or Talend\n* Strong knowledge of SQL and relational databases\n* Understanding of data warehousing concepts and methodologies\n* Familiarity with financial data and systems is a plus\n* Familiarity with Snowflake is a plus"
  }
]